Revit 2024 API
DocumentClosingEventArgs Class
 The event arguments used by the DocumentClosing event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentClosingEventArgs : RevitAPIPreDocEventArgs
Visual Basic
Public Class DocumentClosingEventArgs _
	Inherits RevitAPIPreDocEventArgs
Visual C++
public ref class DocumentClosingEventArgs : public RevitAPIPreDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreDocEventArgs
 Autodesk.Revit.DB.Events.DocumentClosingEventArgs
See Also
DocumentClosingEventArgs Members
Autodesk.Revit.DB.Events Namespace